music_app/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ebSMuZ2XKa1HVc0oQCwT5w"], ["updated_at", "2019-08-30 20:24:37.545739"], ["id", 1]]