music_app/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
<ul style="display:flex;justify-content:center;">
<% Band.all.each do |band| %>